---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.TooManyGeometries
source: html/e5d4f5b0-96ab-6adc-1d5f-72f2508d2d3e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.TooManyGeometries Property

The geometry in this Mass instance is too complex to take advantage of the capabilities a Mass provides. Please break it down into multiple Mass and family instances that are less complex.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyGeometries { get; }
```